function map = Accent(N)
% MatPlotLib 3.3 配色方案
% 输入:
% N   -  定义colormap长度的整数（N>=0）；若为空，则为当前图窗colormap长度
%
% 输出:
% map -  Nx3的RGB颜色矩阵
%
% Copyright  2020   Akun
% https://zhuanlan.zhihu.com/c_1074615528869531648

if nargin<1
	N = size(get(gcf,'colormap'),1);
else
	assert(isscalar(N)&&isreal(N),'First argument must be a real numeric scalar.')
	assert(fix(N)==N&&N>=0,'First argument must be a positive integer.')
end

C = [0.505882352941176,0.776470588235294,0.490196078431373;0.741176470588235,0.682352941176471,0.827450980392157;0.980392156862745,0.749019607843137,0.525490196078431;0.968627450980392,0.952941176470588,0.603921568627451;0.203921568627451,0.423529411764706,0.682352941176471;0.917647058823529,0.0274509803921569,0.498039215686275;0.745098039215686,0.360784313725490,0.156862745098039;0.396078431372549,0.400000000000000,0.396078431372549];

map = C(1+mod(0:N-1,size(C,1)),:);
end

%%%%%%%%%%%%%%%%%%%%%%%%%%
% 制作：阿昆            %%%
% 公众号：阿昆的科研日常 %%%
%%%%%%%%%%%%%%%%%%%%%%%%%%