function map = Pastel2(N)
% MatPlotLib 3.3 配色方案
% 输入:
% N   -  定义colormap长度的整数（N>=0）；若为空，则为当前图窗colormap长度
%
% 输出:
% map -  Nx3的RGB颜色矩阵
%
% Copyright  2020   Akun
% https://zhuanlan.zhihu.com/c_1074615528869531648

if nargin<1
	N = size(get(gcf,'colormap'),1);
else
	assert(isscalar(N)&&isreal(N),'First argument must be a real numeric scalar.')
	assert(fix(N)==N&&N>=0,'First argument must be a positive integer.')
end

C = [0.705882352941177,0.870588235294118,0.796078431372549;0.984313725490196,0.800000000000000,0.670588235294118;0.800000000000000,0.835294117647059,0.909803921568627;0.952941176470588,0.792156862745098,0.874509803921569;0.898039215686275,0.941176470588235,0.788235294117647;0.984313725490196,0.952941176470588,0.686274509803922;0.945098039215686,0.890196078431373,0.800000000000000;0.792156862745098,0.800000000000000,0.800000000000000];

map = C(1+mod(0:N-1,size(C,1)),:);
end

%%%%%%%%%%%%%%%%%%%%%%%%%%
% 制作：阿昆            %%%
% 公众号：阿昆的科研日常 %%%
%%%%%%%%%%%%%%%%%%%%%%%%%%