function map = Pastel1(N)
% MatPlotLib 3.3 配色方案
% 输入:
% N   -  定义colormap长度的整数（N>=0）；若为空，则为当前图窗colormap长度
%
% 输出:
% map -  Nx3的RGB颜色矩阵
%
% Copyright  2020   Akun
% https://zhuanlan.zhihu.com/c_1074615528869531648

if nargin<1
	N = size(get(gcf,'colormap'),1);
else
	assert(isscalar(N)&&isreal(N),'First argument must be a real numeric scalar.')
	assert(fix(N)==N&&N>=0,'First argument must be a positive integer.')
end

C = [0.972549019607843,0.701960784313725,0.686274509803922;0.698039215686275,0.803921568627451,0.894117647058824;0.803921568627451,0.901960784313726,0.764705882352941;0.870588235294118,0.803921568627451,0.882352941176471;0.996078431372549,0.854901960784314,0.650980392156863;0.984313725490196,0.976470588235294,0.811764705882353;0.901960784313726,0.850980392156863,0.741176470588235;0.980392156862745,0.854901960784314,0.905882352941177;0.952941176470588,0.952941176470588,0.952941176470588];

map = C(1+mod(0:N-1,size(C,1)),:);
end

%%%%%%%%%%%%%%%%%%%%%%%%%%
% 制作：阿昆            %%%
% 公众号：阿昆的科研日常 %%%
%%%%%%%%%%%%%%%%%%%%%%%%%%